[
  {
    "name": "How to Apply to a Company ​",
    "founding_year": "",
    "website": "",
    "application_link": "",
    "technologies": [],
    "intro": "Job hunting can often feel overwhelming, especially if you're just starting out or trying to make a significant career move. Over the years, I’ve learned a lot about what works—and what doesn’t—when applying for jobs, both as an applicant and a recruiter.",
    "location": ""
  },
  {
    "name": "AppifyLab Ltd ​",
    "founding_year": "",
    "website": "",
    "application_link": "https://www.appifylab.com/career",
    "technologies": [],
    "intro": "Appify lab has a LMS(Learning Management System) product name EzyCourse",
    "location": ""
  },
  {
    "name": "Bkash ​",
    "founding_year": "",
    "website": "",
    "application_link": "",
    "technologies": [],
    "intro": "Bkash Ltd. is a leading mobile financial service (MFS) provider in Bangladesh, focused on enabling digital financial inclusion. It is a subsidiary of BRAC Bank and partners with global players like Ant Financial.",
    "location": ""
  },
  {
    "name": "Chaldal ​",
    "founding_year": "",
    "website": "",
    "application_link": "",
    "technologies": [],
    "intro": "Chaldal.com, founded in 2013, is a grocery e-commerce platform in Bangladesh. They maintain the whole system by themselves. So, they are a tech company too and arguably one the most prestigious tech company in bangaldesh",
    "location": ""
  },
  {
    "name": "Bevy Commerce ​",
    "founding_year": "",
    "website": "",
    "application_link": "",
    "technologies": [],
    "intro": "Bevy Commerce is a software development studio specializing in cutting-edge eCommerce solutions. They build tailored, innovative products that drive sales and elevate the customer experience for industry giants such as Canadian Tire, Alo Yoga, Authentic Brands Group, and Shopify corporate.",
    "location": ""
  },
  {
    "name": "Brain Station 23 ​",
    "founding_year": "",
    "website": "",
    "application_link": "",
    "technologies": [],
    "intro": "Brain Station 23 is at the forefront of global digital transformation, delivering state-of-the-art technology solutions designed to propel businesses into the future. With expertise spanning software development, cloud computing, enterprise-grade mobile applications, AI and machine learning, and blockchain technology, they offer bespoke solutions that drive innovation and efficiency.",
    "location": ""
  },
  {
    "name": "DSI ​",
    "founding_year": "",
    "website": "",
    "application_link": "",
    "technologies": [],
    "intro": "Dynamic Solution Innovators Ltd is an international software company based in Dhaka, Bangladesh. They have been successfully providing software services since 2001 in both the local and global market.",
    "location": ""
  },
  {
    "name": "Enosis Solutions ​",
    "founding_year": "",
    "website": "",
    "application_link": "",
    "technologies": [],
    "intro": "Enosis is a software development company based in Bangladesh, specializing in web and mobile application development. They focus on delivering high-quality software solutions to clients worldwide.",
    "location": ""
  },
  {
    "name": "Exabyting ​",
    "founding_year": "",
    "website": "",
    "application_link": "",
    "technologies": [],
    "intro": "Exabyting is an international software company based in Dhaka, Bangladesh. They have been successfully providing software services since 2018 in both the local and global market.",
    "location": ""
  },
  {
    "name": "Fringecore ​",
    "founding_year": "",
    "website": "",
    "application_link": "https://work-pool.notion.site/FringeCore_-Careers-cd5106060028424383fcbbb7fc885e38",
    "technologies": [],
    "intro": "Fringecore is a team of engineers and designers, who build software, hack hardware and apply design thinking in-order to tame the chaos in business processes.",
    "location": ""
  },
  {
    "name": "Inverse.Ai ​",
    "founding_year": "",
    "website": "",
    "application_link": "https://inverseai.com/career",
    "technologies": [],
    "intro": "Inverse.Ai specializes in app development that primarily focus on video, audio and image manipulation. Their porfolio contains massive hits apps with more than 15M downloads.",
    "location": ""
  },
  {
    "name": "IQVIA ​",
    "founding_year": "",
    "website": "",
    "application_link": "",
    "technologies": [],
    "intro": "IQVIA is an American Fortune 500 and S&P 500 multinational company serving the combined industries of health information technology and clinical research. They hire professionals from Bangladesh as remote.",
    "location": ""
  },
  {
    "name": "Priyo sys ​",
    "founding_year": "",
    "website": "",
    "application_link": "",
    "technologies": [],
    "intro": "Priyo is a finance based tech company operating in US market. They operate from Bangladesh.",
    "location": ""
  },
  {
    "name": "Kite Games Studio ​",
    "founding_year": "",
    "website": "",
    "application_link": "",
    "technologies": [],
    "intro": "Kite Games Studio (KGS), founded in 2014, is a leading mobile application development firm in Bangladesh. Based in Mohakhali DOHS, Dhaka, KGS specializes in developing software for both iOS and Android platforms, along with building websites. The company is known for its emphasis on competitive programming skills, making it an excellent choice for talented competitive programmers looking to join a dynamic and innovative team.",
    "location": ""
  },
  {
    "name": "Orbitax Bangladesh Limited ​",
    "founding_year": "",
    "website": "",
    "application_link": "",
    "technologies": [],
    "intro": "You are given an HTML string. Your task is to determine the number of characters encompassed by each HTML tag in the string. For each tag, count the number of characters that are enclosed between the opening () tags.",
    "location": ""
  },
  {
    "name": "Optimizely Bangladesh ​",
    "founding_year": "",
    "website": "",
    "application_link": "https://careers.optimizely.com/search/",
    "technologies": [],
    "intro": "Optimizely has recently expanded its global operations with the establishment of a new office in Bangladesh. Optimizely is a leading software company specializing in digital experience platforms (DXP) that empower businesses to enhance their marketing and product strategies. Optimizely offers a comprehensive suite of tools, including a robust Content Management System (CMS) and an integrated Content Marketing Platform (CMP).",
    "location": ""
  },
  {
    "name": "Relisource ​",
    "founding_year": "",
    "website": "",
    "application_link": "https://www.relisource.com/careers/",
    "technologies": [],
    "intro": "For the Junior .NET Developer Position at first there was a 1 hour long written Exam which consisted 3 Questions (SQL Query, Problem Solving, JavaScript-HTML)",
    "location": ""
  },
  {
    "name": "RoBenDevs ​",
    "founding_year": "",
    "website": "",
    "application_link": "https://robendevs.com/careers/",
    "technologies": [],
    "intro": "RoBenDevs specializes in building SaaS solutions.",
    "location": ""
  },
  {
    "name": "Shanghai Baud Data Communication Co. Ltd. ​",
    "founding_year": "",
    "website": "",
    "application_link": "",
    "technologies": [],
    "intro": "BDCOM is a Chinese company specializing in networking and communication solutions. It has established its Research & Development(R&D) department in Bangladesh and recruit intern R&D engineer which is a 6 months program to be a Junior R&D Engineer.",
    "location": ""
  },
  {
    "name": "REVE Systems ​",
    "founding_year": "",
    "website": "",
    "application_link": "",
    "technologies": [],
    "intro": "REVE Systems specializes in delivering VoIP (Voice over IP) software solutions, with a focus on mobile VoIP, softswitch, and billing solutions. They have different departments such as Research & Development (R&D), E-Gov, Reve Chat, etc.",
    "location": ""
  },
  {
    "name": "Spectrum ​",
    "founding_year": "",
    "website": "",
    "application_link": "",
    "technologies": [],
    "intro": "Spectrum Engineering Consortium Ltd. specializes in IP/DWDM/SDH Network infrastructure, Data Center-Cloud solutions Facility, Server, Storage/Virtualizations.",
    "location": ""
  },
  {
    "name": "SRBD ​",
    "founding_year": "",
    "website": "",
    "application_link": "",
    "technologies": [],
    "intro": "Samsung R&D Institute Bangladesh (SRBD) started its journey in February 2011. Located in the heart of Dhaka, it is the first ever R&D hub set up by a multinational company in Bangladesh.",
    "location": ""
  },
  {
    "name": "Synesis IT ​",
    "founding_year": "",
    "website": "",
    "application_link": "https://synesisit.com.bd/career/",
    "technologies": [],
    "intro": "Synesis takes a on campus written test first. The questions contain some coding problem, Database, writting sql, OOP etc The second stage is face to face interview",
    "location": ""
  },
  {
    "name": "Therap ​",
    "founding_year": "",
    "website": "",
    "application_link": "",
    "technologies": [],
    "intro": "Therap (BD) Ltd. is a US-based Software Company registered in Bangladesh, operating since 2004. They have their office in Dhaka, Bangladesh, and affiliate offices in the USA and Canada. Therap has multiple roles.",
    "location": ""
  },
  {
    "name": "Therap Software Engineer ​",
    "founding_year": "",
    "website": "",
    "application_link": "",
    "technologies": [],
    "intro": "The selection process has 3 stages,",
    "location": ""
  },
  {
    "name": "Therap Database Engineer ​",
    "founding_year": "",
    "website": "",
    "application_link": "",
    "technologies": [],
    "intro": "The selection process has 4 stages,",
    "location": ""
  },
  {
    "name": "Therap Machine Learning Engineer ​",
    "founding_year": "",
    "website": "",
    "application_link": "",
    "technologies": [],
    "intro": "all code related answers can be answered in any language but python is preferred",
    "location": ""
  },
  {
    "name": "WSD ​",
    "founding_year": "",
    "website": "https://wsd.bamboohr.com/careers",
    "application_link": "https://wsd.com/career/",
    "technologies": [],
    "intro": "WSD or Wall Street Docs is a US based company trying to expand in Bangladesh.",
    "location": ""
  },
  {
    "name": "WellDev Ltd ​",
    "founding_year": "",
    "website": "",
    "application_link": "https://www.welldev.io/careers",
    "technologies": [],
    "intro": "WellDev Ltd is a software company based in Zurich, Switzerland, specializing in software development and IT services. It has offices in Bangladesh (Dhaka), South Africa, Canada etc.",
    "location": ""
  },
  {
    "name": "Competitions for CSE Students ​",
    "founding_year": "",
    "website": "",
    "application_link": "",
    "technologies": [],
    "intro": "Some of the competitions that a CSE Student of Bangladesh can participate during his undergrad life. Some of them allow students below undergrad or above it too.",
    "location": ""
  }
]